# -это коментарий в петоне
print("hello world")
# **-Возведение в степень
# %-деление по модулю
# //-целочисленное деление с отбрасыванием дробной части
# /-обычное деление, *-умножение, - -вычитание, + -сложение
print(23 % 7)
print(23 // 7)
# int() и цифра -целочисленный тип данных, целые числа
# "" и str() -тип данных строки; f"{} {}" -функция с переменными
# float() -вещественные числа, числа с плавающей точкой
my_name = "Вова"
my_friend = "Никто"
my_number = 13
print(my_name + " " + my_friend)
print(my_name + " 7")
print(my_name + " " + str(my_number))
print(f"{my_name} любимое число {my_number}") #это фукция f string, которая делает интерполяцию строк
print( str(my_name + " ") * 5)
# переменная - это область памяти компьютера, в которой может храниться одиночное значение, знак = я вляется оператором присваивания и сохраняет значение.
color = "синий"
print(color)
# имя переменной должно представлять одно слово без пробелов. В имени переменной могут использоваться только буквы, цифры и подчеркивания(_)
# имя переменной не может начинаться с цифры. нет "-" и спец символов "№"
_ = "my little var"
print(_)
print(len(my_name)) # считает кол-во символов в строке (функция для подсчета)
my_namy = int(input("ввод"))
#my_namy1 = float(input("ввод")) #функция которая преобразовывает строки в числа с плавающей точкой
print(8 + my_namy)
#print(5 + my_namy1)
# все что ввожу в "input" на выходе будет определяться как строка
# int() -функция которая преобразовывает строки в числа
# конкатенация - это сложение/склеивание строк
# репликация - это умножение разных типов данных

print(len("hello world"))



