# -это коментарий в петоне
print("hello world")
# **-Возведение в степень
# %-деление по модулю
# //-целочисленное деление с отбрасыванием дробной части
# /-обычное деление, *-умножение, - -вычитание, + -сложение
print(23 % 7)
print(23 // 7)
# int() и цифра -целочисленный тип данных, целые числа
# "" и str() -тип данных строки; f"{} {}" -функция с переменными
# float -вещественные числа, числа с плавающей точкой
my_name = "Вова"
my_friend = "Никто"
my_number = 13
print(my_name + " " + my_friend)
print(my_name + " 7")
print(my_name + " " + str(my_number))
print(f"{my_name} любимое число {my_number}")
print( str(my_name + " ") * 5)
# переменная - это область памяти компьютера, в которой может храниться одиночное значение, знак = я вляется оператором присваивания и сохраняет значение.
color = "синий"
print(color)

